Repository: BurconOutfitters/sturtevant-reservations
Catalog: languages/bccf-*.po
Languages: mt_mt

source: Email
mt_mt: Posta elettronika

source: Subject
mt_mt: Suġġett

source: Message
mt_mt: Messaġġ:

source: Help
mt_mt: Għajnuna

source: Request custom changes
mt_mt: Jitolbu bidla custom

source: Insert Booking Calendar
mt_mt: Daħħal Booking Kalendarju

source: Insert Reservation Calendar
mt_mt: Daħħal Riżerva Kalendarju

source: Select Start Date
mt_mt: Agħżel Bidu Data

source: Select End Date
mt_mt: Agħżel Tmiem Data

source: Cancel Selection
mt_mt: Ikkanċella Għażla

source: Successfully
mt_mt: B&#39;suċċess

source: Previous
mt_mt: Preċedenti

source: Next
mt_mt: Li jmiss

source: Calendar
mt_mt: Kalendarju

source: The minimum number of nights to book is
mt_mt: In-numru minimu ta &#39;ljieli li ktieb huwa

source: The maximum number of nights to book is
mt_mt: In-numru massimu ta &#39;ljieli li ktieb huwa

source: Select start and end dates
mt_mt: Bidu jagħżel u dati ta &#39;skadenza

source: Please select start and end dates
mt_mt: Jekk jogħġbok agħżel dati tal-bidu u tat-tmiem

source: Cost
mt_mt: Kost

source: Coupon code (optional)
mt_mt: Kodiċi tal-kupun (fakultattiv)

source: Service
mt_mt: Servizz

source: Please enter the security code
mt_mt: Jekk jogħġbok daħħal il-kodiċi tas-sigurtà

source: Security Code (lowercase letters)
mt_mt: Kodiċi tas-Sigurtà (ittri lowercase)

source: Continue
mt_mt: Kompli
